sad-zz/ESP32-S3-Vending-Machine2/TFT_eSPI.cpp
/***************************************************
  Arduino TFT graphics library targeted at 32 bit
  processors such as ESP32, ESP8266 and STM32.

  This is a stand-alone library that contains the
  hardware driver, the graphics functions and the
  proportional fonts.

  The larger fonts are Run Length Encoded to reduce their
  size.

  Created by Bodmer 2/12/16
  Last update by Bodmer 20/03/20
 ****************************************************/

#include "TFT_eSPI.h"

#if defined (ESP32)
  #if defined(CONFIG_IDF_TARGET_ESP32S3)
    #include "Processors/TFT_eSPI_ESP32_S3.c" // Tested with SPI and 8 bit parallel
  #elif defined(CONFIG_IDF_TARGET_ESP32C3)
    #include "Processors/TFT_eSPI_ESP32_C3.c" // Tested with SPI (8 bit parallel will probably work too!)
  #else
    #include "Processors/TFT_eSPI_ESP32.c"
  #endif
#elif defined (ARDUINO_ARCH_ESP8266)
  #include "Processors/TFT_eSPI_ESP8266.c"
#elif defined (STM32) // (_VARIANT_ARDUINO_STM32_) stm32_def.h
  #include "Processors/TFT_eSPI_STM32.c"
#elif defined (ARDUINO_ARCH_RP2040)  || defined (ARDUINO_ARCH_MBED) // Raspberry Pi Pico
  #include "Processors/TFT_eSPI_RP2040.c"
#else
  #include "Processors/TFT_eSPI_Generic.c"
#endif

const uint8_t  PEmap[63][6]  PROGMEM = {
		{0xC1,0xC1,0xC1,0xC1,0,0},	//0 	-	193
		{0xC2,0xC2,0x02,0x02,1,0},	//1  	-	194
		{0xC3,0xC3,0x01,0x01,1,0},	//2  	-	195
		{0xC4,0xC4,0xC4,0xC4,0,0},	//3  	-	196
		{0xC5,0xC5,0x03,0x03,1,0},	//4  	-	197
		{0xC6,0xC6,0xC6,0xC6,0,0},	//5  	-	198
		{0xC7,0xC7,0x00,0x00,1,0},	//6  	-	199
		{0xC8,0x04,0xC8,0x04,1,1},	//7  	-	200
		{0xC9,0xFE,0xE9,0x95,1,1},	//8  	-	201
		{0xCA,0x05,0xCA,0x05,1,1},	//9     -	202
		{0xCB,0x06,0xCB,0x06,1,1},	//10 	-	203
		{0xCC,0x07,0x08,0x07,1,1},	//11 	-	204
		{0xCD,0x09,0x9A,0x09,1,1},	//12 	-	205
		{0xCE,0x0B,0x0C,0x0B,1,1},	//13 	-	206
		{0xCF,0xCF,0xCF,0xCF,1,0},	//14 	-	207
		{0xD0,0xD0,0xD0,0xD0,1,0},	//15 	-	208
		{0xD1,0xD1,0xD1,0xD1,1,0},	//16 	-	209
		{0xD2,0xD2,0xD2,0xD2,1,0},	//17 	-	210
		{0xD3,0x8A,0xD3,0x8A,1,1},	//18 	-	211
		{0xD4,0x0E,0xD4,0x0E,1,1},	//19 	-	212
		{0xD5,0x0F,0xD5,0x0F,1,1},	//20 	-	213
		{0xD6,0x1A,0xD6,0x1A,1,1},	//21 	-	214
		{0xD7,0xD7,0xD7,0xD7,0,0},	//22 	-	215
		{0xD8,0xD8,0xD8,0xD8,1,1},	//23 	-	216
		{0xD9,0xD9,0xD9,0xD9,1,1},	//24 	-	217
		{0xDA,0x1B,0xF1,0xF0,1,1},	//25 	-	218
		{0xDB,0xF5,0x7F,0xF6,1,1},	//26 	-	219
		{0xDC,0xDC,0xDC,0xDC,1,1},	//27 	-	220
		{0xDD,0x80,0xDD,0x80,1,1},	//28 	-	221
		{0xDE,0x83,0xDE,0x83,1,1},	//29 	-	222
		{0xDF,0x8C,0xDF,0x8C,1,1},	//30 	-	223
		{0xE0,0xE0,0xE0,0xE0,0,0},	//31 	-	224
		{0xE1,0xF3,0xE1,0xF3,1,1},	//32 	-	225
		{0xE2,0xE2,0xE2,0xE2,0,0},	//33 	-	226
		{0xE3,0xF8,0xE3,0xF8,1,1},	//34 	-	227
		{0xE4,0xF2,0xE4,0xF2,1,1},	//35 	-	228
		{0xE5,0xFE,0xE7,0x95,1,1},	//36 	-	229
		{0xE6,0xE6,0xE6,0xE6,1,0},	//37 	-	230
		{0xE7,0xE7,0xE7,0xE7,0,0},	//38 	-	231
		{0xE8,0xE8,0xE8,0xE8,0,0},	//39 	-	232
		{0xE9,0xE9,0xE9,0xE9,0,0},	//40 	-	233
		{0x81,0xFD,0x81,0xFD,1,1},	//41 	-	234
		{0x8D,0x9D,0x9E,0x9D,1,1},	//42 	-	235
		{0xEC,0xC0,0xA0,0xC0,1,1},	//43 	-	236
		{0xED,0xC0,0x9C,0xC0,1,1},	//44 	-	237
		{0x8E,0x8E,0x8E,0x8E,1,0},	//45 	-	238
		{0x90,0xFA,0x90,0xFA,1,1},	//46 	-	239
		{0xF0,0xF0,0xF0,0xF0,0,0},	//47 	-	240
		{0xF1,0xF1,0xF1,0xF1,0,0},	//48 	-	241
		{0xF2,0xF2,0xF2,0xF2,0,0},	//49 	-	242
		{0xF3,0xF3,0xF3,0xF3,0,0},	//50 	-	243
		{0xF4,0xF4,0xF4,0xF4,0,0},	//51 	-	244
		{0xF5,0xF5,0xF5,0xF5,0,0},	//52 	-	245
		{0xF6,0xF6,0xF6,0xF6,0,0},	//53 	-	246
		{0xF7,0xF7,0xF7,0xF7,0,0},	//54 	-	247
		{0xF8,0xF8,0xF8,0xF8,0,0},	//55 	-	248
		{0xF9,0xF9,0xF9,0xF9,0,0}, 	//56 	-	249
		{0xFA,0xFA,0xFA,0xFA,0,0}, 	//57 	-	250
		{0xA5,0xA5,0x9F,0x9F,1,0}, 	//58 	-	251
		{0xFC,0xFC,0xFC,0xFC,0,0}, 	//59 	-	252
		{0xFD,0xFD,0xFD,0xFD,0,0}, 	//60 	-	253
		{0xFE,0xFE,0xFE,0xFE,0,0}, 	//61 	-	254
		{0xFF,0xFF,0xFF,0xFF,0,0} 	//62 	-	255
		};


#ifndef SPI_BUSY_CHECK
  #define SPI_BUSY_CHECK
#endif

// Clipping macro for pushImage
#define PI_CLIP                                        \
  if (_vpOoB) return;                                  \
  x+= _xDatum;                                         \
  y+= _yDatum;                                         \
                                                       \
  if ((x >= _vpW) || (y >= _vpH)) return;              \
                                                       \
  int32_t dx = 0;                                      \
  int32_t dy = 0;                                      \
  int32_t dw = w;                                      \
  int32_t dh = h;                                      \
                                                       \
  if (x < _vpX) { dx = _vpX - x; dw -= dx; x = _vpX; } \
  if (y < _vpY) { dy = _vpY - y; dh -= dy; y = _vpY; } \
                                                       \
  if ((x + dw) > _vpW ) dw = _vpW - x;                 \
  if ((y + dh) > _vpH ) dh = _vpH - y;                 \
                                                       \
  if (dw < 1 || dh < 1) return;

/***************************************************************************************
** Function name:           Legacy - deprecated
** Description:             Start/end transaction
***************************************************************************************/
  void TFT_eSPI::spi_begin()       {begin_tft_write();}
  void TFT_eSPI::spi_end()         {  end_tft_write();}
  void TFT_eSPI::spi_begin_read()  {begin_tft_read(); }
  void TFT_eSPI::spi_end_read()    {  end_tft_read(); }

/***************************************************************************************
** Function name:           begin_tft_write (was called spi_begin)
** Description:             Start SPI transaction for writes and select TFT
***************************************************************************************/
inline void TFT_eSPI::begin_tft_write(void){
  if (locked) {
    locked = false; // Flag to show SPI access now unlocked
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
    spi.beginTransaction(SPISettings(SPI_FREQUENCY, MSBFIRST, TFT_SPI_MODE));
#endif
    CS_L;
    SET_BUS_WRITE_MODE;  // Some processors (e.g. ESP32) allow recycling the tx buffer when rx is not used
  }
}

// Non-inlined version to permit override
void TFT_eSPI::begin_nin_write(void){
  if (locked) {
    locked = false; // Flag to show SPI access now unlocked
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
    spi.beginTransaction(SPISettings(SPI_FREQUENCY, MSBFIRST, TFT_SPI_MODE));
#endif
    CS_L;
    SET_BUS_WRITE_MODE;  // Some processors (e.g. ESP32) allow recycling the tx buffer when rx is not used
  }
}

/***************************************************************************************
** Function name:           end_tft_write (was called spi_end)
** Description:             End transaction for write and deselect TFT
***************************************************************************************/
inline void TFT_eSPI::end_tft_write(void){
  if(!inTransaction) {      // Flag to stop ending transaction during multiple graphics calls
    if (!locked) {          // Locked when beginTransaction has been called
      locked = true;        // Flag to show SPI access now locked
      SPI_BUSY_CHECK;       // Check send complete and clean out unused rx data
      CS_H;
      SET_BUS_READ_MODE;    // In case bus has been configured for tx only
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
      spi.endTransaction();
#endif
    }
  }
}

// Non-inlined version to permit override
inline void TFT_eSPI::end_nin_write(void){
  if(!inTransaction) {      // Flag to stop ending transaction during multiple graphics calls
    if (!locked) {          // Locked when beginTransaction has been called
      locked = true;        // Flag to show SPI access now locked
      SPI_BUSY_CHECK;       // Check send complete and clean out unused rx data
      CS_H;
      SET_BUS_READ_MODE;    // In case SPI has been configured for tx only
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
      spi.endTransaction();
#endif
    }
  }
}

/***************************************************************************************
** Function name:           begin_tft_read  (was called spi_begin_read)
** Description:             Start transaction for reads and select TFT
***************************************************************************************/
// Reads require a lower SPI clock rate than writes
inline void TFT_eSPI::begin_tft_read(void){
  DMA_BUSY_CHECK; // Wait for any DMA transfer to complete before changing SPI settings
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
  if (locked) {
    locked = false;
    spi.beginTransaction(SPISettings(SPI_READ_FREQUENCY, MSBFIRST, TFT_SPI_MODE));
    CS_L;
  }
#else
  #if !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
    spi.setFrequency(SPI_READ_FREQUENCY);
  #endif
   CS_L;
#endif
  SET_BUS_READ_MODE;
}


/***************************************************************************************
** Function name:           end_tft_read (was called spi_end_read)
** Description:             End transaction for reads and deselect TFT
***************************************************************************************/
inline void TFT_eSPI::end_tft_read(void){
#if defined (SPI_HAS_TRANSACTION) && defined (SUPPORT_TRANSACTIONS) && !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
  if(!inTransaction) {
    if (!locked) {
      locked = true;
      CS_H;
      spi.endTransaction();
    }
  }
#else
  #if !defined(TFT_PARALLEL_8_BIT) && !defined(RP2040_PIO_INTERFACE)
    spi.setFrequency(SPI_FREQUENCY);
  #endif
   if(!inTransaction) {CS_H;}
#endif
  SET_BUS_WRITE_MODE;
}

/***************************************************************************************
** Function name:           setViewport
** Description:             Set the clipping region for the TFT screen
***************************************************************************************/
void TFT_eSPI::setViewport(int32_t x, int32_t y, int32_t w, int32_t h, bool vpDatum)
{
  // Viewport metrics (not clipped)
  _xDatum  = x; // Datum x position in screen coordinates
  _yDatum  = y; // Datum y position in screen coordinates
  _xWidth  = w; // Viewport width
  _yHeight = h; // Viewport height

  // Full size default viewport
  _vpDatum = false; // Datum is at top left corner of screen (true = top left of viewport)
  _vpOoB   = false; // Out of Bounds flag (true is all of viewport is off screen)
  _vpX = 0;         // Viewport top left corner x coordinate
  _vpY = 0;         // Viewport top left corner y coordinate
  _vpW = width();   // Equivalent of TFT width  (Nb: viewport right edge coord + 1)
  _vpH = height();  // Equivalent of TFT height (Nb: viewport bottom edge coord + 1)

