sad-zz/ESP32-S3-Vending-Machine2/TFT_eSPI.cpp
		unsigned char 			Ccounter 			= 0;
		unsigned char 			xc 						= 0;
		unsigned char 			yc 						= 0;
		unsigned char 			sx 						= 0;
		unsigned char 			sy 						= 0;
		
		// get current character width
		charwidth	= pgm_read_byte(&FontPointer[(unsigned int)(c)+FONT_HEADER_SIZE-firstchar]);
		
		// line feed, goto next line
		if(c == '\n')
		{
      // TFTWidth=LCD_WIDTH-1;
			cursorX = TFTWidth;
			cursorY += (unsigned int)(FontHeight +FontSpaceY)* FontYScale;
			
			return;
		}
	
		// character out of range.
	  if( (c < firstchar) || (c > lastchar) || (fontSize == 0)) 
	  	return;
	
		// character is not in list.
		if (charwidth == 0)
			return;
	
		// sara thai font. line remain at last position
		if(FontFixed)
			charwidth = FontWidth;
		
		// line adjust
		if(((int)cursorX - charwidth * FontXScale) < 0)
	  {
      // TFTWidth=LCD_WIDTH-1;
			cursorY = cursorY   + (unsigned int)FontHeight * FontYScale; 
			cursorX = TFTWidth - (unsigned int)charwidth * FontXScale;
		}
	
		// adjust cursor to current position - persian
		cursorX	-= (unsigned int)charwidth * FontXScale + FontSpaceX;
	
		// calculate current character position on the table
		for(Ccounter = 0; Ccounter < c-firstchar; Ccounter++)
			bitsbischar += (pgm_read_byte(&FontPointer[(unsigned int)(Ccounter)+FONT_HEADER_SIZE]));	//c0_width +...+ cn_width
	
	
		bitsbischar 		*= FontHeight;																										//c_widths * FH
		bitsbischar 		+= (((unsigned short)(lastchar)-firstchar)+FONT_HEADER_SIZE)*8;		//plus font headers
		bytesbischar 		 = bitsbischar/8;									//
		bitoffset 			 = bitsbischar % 8;								//
		maske						 = bitoffset % 8;									//
	
		// draw character
		for(xc = 0; xc < charwidth; xc++)
		{
			for(yc = 0; yc < FontHeight; yc++)
			{
				if(maske > 7)
				{
					maske = 0;
					bcounter+=1;
				}
				byte = pgm_read_byte(&FontPointer[bytesbischar + bcounter + 1]);
	
				xPos = (unsigned short)xc*FontXScale + cursorX;
				
				if(Horizontal)	//128x64
				{
					if(Reverse)
						yPos = (((unsigned short)FontHeight-yc)*FontYScale + cursorY);
					else
						yPos = (((unsigned short)yc)*FontYScale + cursorY);     
				}
				else						//64x128
				{
					if(Reverse)
						yPos = (((unsigned short)FontHeight-yc)*FontYScale + cursorY);
					else
						yPos = (((unsigned short)yc)*FontYScale + cursorY);
					
				}	//Horizontal
	
				for(sx = 0; sx < FontXScale; sx++)
				{
					for(sy = 0; sy < FontYScale; sy++)
					{
						if(Bit_Is_Set(byte,maske))
						{
							if(rot)		PutPixel(yPos+sy, xPos+sx, FgColor);
							else			PutPixel(xPos+sx, yPos+sy, FgColor);
						}
						else
						{
							if(NonTransparence)
							{
								if(rot)		PutPixel(yPos+sy, xPos+sx, BkColor);
								else			PutPixel(xPos+sx, yPos+sy, BkColor);
							}
						}
					}//for sy
				}//for sx
				
				maske++;
			}//for yc
		}//for xc	
}	//*PutCharPE

unsigned int TFT_eSPI::CalcTextWidthEN(char *str)
{
	unsigned int 		strSize = 0;
	unsigned char 	c;
	unsigned int 		i = 0;	

	while(str[i])
	{
		c = str[i++];
		
		if(c == '\n')			continue;
		
		if(FontFixed)
			strSize += (unsigned int)(FontWidth) * FontXScale;
		else
		{
		  if((c < firstchar) || (c > lastchar)) 
				charwidth = FontWidth;
			else
			{
				charwidth = pgm_read_byte(&FontPointer[(unsigned int)(c)+FONT_HEADER_SIZE-firstchar]);

				//english spesial fonts!
				if (((c >= 0xd4) && (c <= 0xda)) || 
		    		((c >= 0xe7) && (c <= 0xec)) ||
				  	 (c == 0xd1))

					charwidth = 0;
			}
			
			strSize += (unsigned int)(charwidth) * FontXScale;
		}
		
		strSize += FontSpaceX;
	}//while
	
	return(strSize);
}	//*CalcTextWidthEN

unsigned int TFT_eSPI::CalcTextWidthPE(char *str)
{
		unsigned char 	curnLet, dumyLet;
		unsigned char 	Pstat, stat, Nstat;
		
		unsigned char		backFontSpace = FontSpaceX;
		unsigned int 		strSize = 0;
		unsigned int		i = 0;
		
	 	while(str[i])
		{ 		
			curnLet = str[i++];
			if(curnLet == '\n')			continue;
		
			if(FontFixed)
				strSize += (unsigned int)(FontWidth) * FontXScale;
			else
			{
			 	if((curnLet < firstchar) || (curnLet > lastchar)) 
					charwidth = FontWidth;
				else
				{
			 		switch(curnLet)
			 		{	
			 			case 0x81:				//peh
			    		curnLet = 0xEA;
			 				break;
			 			case 0x8D:				//cheh
			    		curnLet = 0xEB;
			 				break;
			 			case 0x8E:				//zheh
			    		curnLet = 0xEE;
			 				break;
			 			case 0x90:				//geh
			    		curnLet = 0xEF;
			 				break;
			   			case 0x98:				//Ke
		       			curnLet = 0xDF;
		 		    		break;								 
			 			case 0xE1:				//laa
			    		nextLet = str[i++];
			    		
			    		if(nextLet == 0xC7)
			    			curnLet = 0xFB;
			    		else
			    		{
			    			i--;
			    			curnLet = 0xE1;
			    		}
			 				break;
			 			case 0x30:				//persian digits 0...9
						case 0x31:
						case 0x32:
						case 0x33:
						case 0x34:
						case 0x35:
						case 0x36:
						case 0x37:
						case 0x38:
						case 0x39:
							curnLet -= 0x20;
			 				break;
			 			case 0x3F:				//persian question mark
			    		curnLet = 0xBF;
			 				break;
			 			case 0x3B:				//persian semicolon
			    		curnLet = 0x1F;
			 				break;
			 			case 0x2C:				//persian comma
			    		curnLet = 0x1D;
			 				break;
			 			case 0x2E:				//persian point
			    		curnLet = 0x1C;
			 				break; 				
					}//switch curnLet
			
					//--------------------------------
			  	nextLet = str[i++];
			  	i--;
			  	
			 		switch(nextLet)
			 		{	
			 			case 0x81:				//peh
			    		nextLet = 0xEA;
			 				break;
			 			case 0x8D:				//cheh
			    		nextLet = 0xEB;
			 				break;
			 			case 0x8E:				//zheh
			    		nextLet = 0xEE;
			 				break;
			 			case 0x90:				//geh
			    		nextLet = 0xEF;
			 				break;
			   			case 0x98:				//Ke
		      			 curnLet = 0xDF;
		 		   			 break;								 
			 			case 0x30:				//0...9
						case 0x31:
						case 0x32:
						case 0x33:
						case 0x34:
						case 0x35:
						case 0x36:
						case 0x37:
						case 0x38:
						case 0x39:
							nextLet -= 0x20;
			 				break; 			
			 			case 0x3F:				//persian question mark
			    		nextLet = 0xBF;
			 				break;
			 			case 0x3B:				//persian semicolon
			    		nextLet = 0x1F;
			 				break;
			 			case 0x2C:				//persian comma
			    		nextLet = 0x1D;
			 				break;
			 			case 0x2E:				//persian point
			    		nextLet = 0x1C;
			 				break; 				
					}//switch nextLet
	
					if(curnLet > 0xC0)
					{		
						if(prevLet > 0xC0)
							Pstat = (pgm_read_byte(&PEmap[prevLet-0xC1][5]));
						else
							Pstat = 0;
							
						if(nextLet > 0xC0)
							Nstat = (pgm_read_byte(&PEmap[nextLet-0xC1][4]));
						else
							Nstat = 0;
						
						stat = (Pstat<<1) | Nstat;		
						
						if(stat>1)	FontSpaceX = 0;
						else 				FontSpaceX = backFontSpace;
						////////////////
						dumyLet = pgm_read_byte(&PEmap[curnLet-0xC1][stat]);
						
