sad-zz/ESP32-S3-Vending-Machine2/TFT_eSPI.cpp
						charwidth = pgm_read_byte(&FontPointer[(unsigned int)(dumyLet)+FONT_HEADER_SIZE-firstchar]);
						strSize += (unsigned int)(charwidth) * FontXScale;
						strSize += FontSpaceX;
						////////////////
						FontSpaceX = backFontSpace;
					}
					else
					{
						charwidth = pgm_read_byte(&FontPointer[(unsigned int)(curnLet)+FONT_HEADER_SIZE-firstchar]);
						strSize += (unsigned int)(charwidth) * FontXScale;
						strSize += FontSpaceX;
					}
					
					prevLet = curnLet;
				}
			}
		}//while
	
	 	prevLet = 0xFF;
	 	
		return(strSize);
}	//*CalcTextWidthPE

unsigned int TFT_eSPI::CalcTextWidth(char *Text)
{

		if(peLETTER == E_LETTER)
			return(CalcTextWidthEN(Text));
		else
			return(CalcTextWidthPE(Text));
}	//*CalcTextWidth

unsigned int TFT_eSPI::CalcTextHeight(void)
{
	return((unsigned int)(FontHeight) * FontYScale);
}	//*CalcTextHeight


// Convert a single Character from UTF8 to Extended ASCII
// Return "0" if a byte has to be ignored
unsigned char   TFT_eSPI:: utf8ascii(unsigned char ascii) {

    if ( ascii < (unsigned char)128 )   // Standard ASCII-set 0..0x7F handling
    {   
	  c1=0;
      return( ascii );
    }

    // get previous input
    unsigned char last = c1;   // get last char
    c1=ascii;         // remember actual character

switch (last)     // conversion depending on first UTF8-character
    {
case (unsigned char)0xd8:
        if(ascii >= (unsigned char)0xa0 && ascii <= (unsigned char)0xb6)
        {
        return (ascii + 0x20);  
        }

        if(ascii>=(unsigned char)0xb7 && ascii<=(unsigned char)0xba)
        {
        	return (ascii + 0x21);
        }
        break;
case (unsigned char)0xd9:
        if(ascii>=(unsigned char)0x80 && ascii<=(unsigned char)0x83)
        {
        	return (ascii + 0x5c); 
        }

        if(ascii==(unsigned char)0x84)
        {
        	return (ascii + 0x5d);
        }

        if(ascii>=(unsigned char)0x85 && ascii<=(unsigned char)0x88)
        {
        	return (ascii + 0x5e);
        }

        if(ascii==(unsigned char)0x89 || ascii==(unsigned char)0x8a)
        {
        	return (ascii + 0x63); 
        }

        if(ascii==(unsigned char)0xbe)
        {
        	return 0x81;
        }
        break;
case (unsigned char)0xda:
        if(ascii==(unsigned char)0x86)
        {
        	return 0x8d;
        }
        if(ascii==(unsigned char)0x98)//zhe
        {
        	return 0x8e;
        }

        if(ascii==(unsigned char)0xaf)
        {
        	return 0x90;
        }
        if(ascii==(unsigned char)0xa9)//ke
          {
          	return 0xdf;
          }
				break;	
case (unsigned char)0xdb:
        if(ascii==(unsigned char)0x8c)
        {
        	return 0xed;
        }
        break;
    }

    return  (0);                                     // otherwise: return zero, if character has to be ignored
}



void TFT_eSPI:: PutsPE(char *str0)
{	
		unsigned char 	curnLet;
		unsigned char 	Pstat, stat, Nstat;
		
		unsigned char		backFontSpace = FontSpaceX;
		unsigned char 						strTemp[50];
		unsigned char 						str[50];
	    unsigned char 	i = 0, j = 0,c=0;
		unsigned int		k = 0;

			// ****** UTF8-Decoder: convert UTF8-string to extended ASCII *******
	        for (i=0; i<strlen(str0); i++)
	        {
				
	                c = utf8ascii(str0[i]);
	                if (c!=0) str[k++]=c;

	        }			
	        str[k]=0;
	        i = 0;
	        k=0;

	 	while(str[k])
		{ 		
	 		curnLet = str[k++];
	 		
	 		switch(curnLet)
	 		{	
	 			case 0x81:				//peh
	    		curnLet = 0xEA;
	 				break;
	 			case 0x8D:				//cheh
	    		curnLet = 0xEB;
	 				break;
	 			case 0x8E:				//zheh
	    		curnLet = 0xEE;
	 				break;
	 			case 0x90:				//geh
	    		curnLet = 0xEF;
	 				break;
			   case 0x98:				//Ke
		       curnLet = 0xDF;
		 		    break;					 
	 			case 0xE1:				//laa
	    		nextLet = str[k++];
	    		
	    		if(nextLet == 0xC7)
	    			curnLet = 0xFB;
	    		else
	    		{
	    			k--;
	    			curnLet = 0xE1;
	    		}
	 				break;
	 			case 0x3F:				//persian question mark
	    		curnLet = 0xBF;
	 				break;
	 			case 0x3B:				//persian semicolon
	    		curnLet = 0x1F;
	 				break;
	 			case 0x2C:				//persian comma
	    		curnLet = 0x1D;
	 				break;
	 			case 0x2E:				//persian point
	    		curnLet = 0x1C;
	 				break; 				
			}//switch curnLet
			
			//--------------------------------
	  	nextLet = str[k++];
	  	k--;
	 	
	 		switch(nextLet)
	 		{	
	 			case 0x81:				//peh
	    		nextLet = 0xEA;
	 				break;
	 			case 0x8D:				//cheh
	    		nextLet = 0xEB;
	 				break;
	 			case 0x8E:				//zheh
	    		nextLet = 0xEE;
	 				break;
	 			case 0x90:				//geh
	    		nextLet = 0xEF;
	 				break;
				case 0x98:				//Ke
		        curnLet = 0xDF;
		 		    break;		 
	 			case 0x3F:				//persian question mark
	    		nextLet = 0xBF;
	 				break;
	 			case 0x3B:				//persian semicolon
	    		nextLet = 0x1F;
	 				break;
	 			case 0x2C:				//persian comma
	    		nextLet = 0x1D;
	 				break;
	 			case 0x2E:				//persian point
	    		nextLet = 0x1C;
	 				break; 			
			}//switch nextLet
	
			if(curnLet > 0xC0)
			{		
				if(prevLet > 0xC0)
					Pstat = (pgm_read_byte(&PEmap[prevLet-0xC1][5]));		// 1: prevLet attach to curnLet -- 0: prevLet don't attach to curnLet
				else
					Pstat = 0;
					
				if(nextLet > 0xC0)
					Nstat = (pgm_read_byte(&PEmap[nextLet-0xC1][4]));		// 1: nextLet attach to curnLet -- 0: nextLet don't attach to curnLet
				else
					Nstat = 0;
				
				//			Pstat	|	Nstat	|	stat
				//		 -------+-------+------
				//				0		|		0		|		0				curnLet, don't attach to prevLet and nextLet
				//				0		|		1		|		1				curnLet, don't attach to prevLet and attach to nextLet
				//				1		|		0		|		2				curnLet, attach to prevLet and don't attach to nextLet
				//				1		|		1		|		3				curnLet, attach to prevLet and nextLet
				
				stat = (Pstat<<1) | Nstat;		
				
				if(stat>1)	FontSpaceX = 0;
				else 				FontSpaceX = backFontSpace;
				
				PutCharPE(pgm_read_byte(&PEmap[curnLet-0xC1][stat]));
				FontSpaceX = backFontSpace;
			}
			else	//Original 'curnLet' below 193 without ( � � � � )  -- for digits and symbols!
			{
	  		if((curnLet >= '0') && (curnLet <= '9'))		// 0 to 9
	  		{
	  			i++;
	  			strTemp[i] 	 = curnLet;
	
	  			if(!((nextLet >= '0') && (nextLet <= '9')))
					{
						for(j=i; j>0; j--)
							PutCharPE(strTemp[j]-0x20);
	
						i = 0;
					}
				}		
				else
					PutCharPE(curnLet);
			}
			
			prevLet = curnLet;
		}//while
	
	 	prevLet = 0xFF;
}	//*PutsPE

//-------------------------------------------------
//**** select font
void TFT_eSPI:: SetFont(const unsigned char *pointer)
{
	FontPointer 			= pointer;

	FontWidth 				= pgm_read_byte(&FontPointer[2]);
	FontHeight				= pgm_read_byte(&FontPointer[3]);

	fontSize				=	pgm_read_word(&FontPointer[0]);
	firstchar 				=	pgm_read_byte(&FontPointer[5]);
	lastchar 				=	pgm_read_byte(&FontPointer[6]);
}	//*LcdFont

