sad-zz/ESP32-S3-Vending-Machine2/TFT_eSPI.cpp
void TFT_eSPI:: SetLetter(Lt_Mode L)
{
		peLETTER = L;

		if(L == P_LETTER){
			 if(p_rotation ==1 || p_rotation ==3) {TFTWidth=LCD_HEIGHT-1;TFTHeight=LCD_WIDTH-1;cursorX = TFTWidth;}else if(p_rotation ==0 || p_rotation ==2){TFTWidth=LCD_WIDTH-1;TFTHeight=LCD_HEIGHT-1;cursorX = TFTWidth;};

}else{
  if(p_rotation ==1 || p_rotation ==3) {TFTWidth=LCD_HEIGHT-1;TFTHeight=LCD_WIDTH-1;cursorX = 0;}else if(p_rotation ==0 || p_rotation ==2){TFTWidth=LCD_WIDTH-1;TFTHeight=LCD_HEIGHT-1;cursorX = 0; };
  }
		
			
}	//*SetLetter

void TFT_eSPI:: SetLine(unsigned char line,unsigned char column)
{
		if(peLETTER == P_LETTER){
			if(p_rotation ==1 || p_rotation ==3) 
			{
				cursorX =TFTWidth - (unsigned int)FontWidth  * FontXScale * column;
				}else if(p_rotation ==0 || p_rotation ==2){
					cursorX =TFTWidth - (unsigned int)FontWidth  * FontXScale * column;
					};
		
		}else{cursorX =(unsigned int)FontWidth  * FontXScale * column;};
			

	cursorY =(unsigned int)(FontHeight +FontSpaceY)* FontYScale * line;
}	//*SetLine


//**** draw char
void TFT_eSPI:: PutChar(unsigned char c)
{
	  if(peLETTER == P_LETTER)
			PutCharPE(c);
		else
			PutCharEN(c);
}	//*PutChar

//**** draw string
void TFT_eSPI:: Puts(char *Text)
{	
	unsigned int		i = 0;
	
	  if(peLETTER == P_LETTER)
	  {
			PutsPE(Text);
		}
		else
		{
			while(Text[i])
				PutCharEN(Text[i++]);
		}
}	//*Puts

unsigned char TFT_eSPI:: Bit_Is_Set(unsigned char Byte ,unsigned char Mask)
{
	if(Byte&(0x01<<Mask))
		return 1;
	else 
		return 0;
}

void TFT_eSPI::drawString(unsigned char line, unsigned char column,char *str,unsigned int Fg,unsigned int Bg)
{
FgColor 				= Fg;			
BkColor 				= Bg;
SetLine(line,column);
Puts(str);
}

void TFT_eSPI::LcdFontXScale(unsigned char n)
{
FontXScale = n;
}

void TFT_eSPI::LcdFontYScale(unsigned char n)
{
FontYScale = n;
}

void TFT_eSPI::SetCursor(unsigned char x ,unsigned char y )
{
cursorX = x;cursorY = y;
}

void TFT_eSPI::SetFgColor(unsigned char n)
{
FgColor = n;
}
void TFT_eSPI::SetBkColor(unsigned char n)
{
BkColor = n;
}


////////////////////////////////////////////////////////////////////////////////////////
#ifdef TOUCH_CS
  #include "Extensions/Touch.cpp"
#endif

#include "Extensions/Button.cpp"

#include "Extensions/Sprite.cpp"

#ifdef SMOOTH_FONT
  #include "Extensions/Smooth_font.cpp"
#endif

#ifdef AA_GRAPHICS
  #include "Extensions/AA_graphics.cpp"  // Loaded if SMOOTH_FONT is defined by user
#endif
////////////////////////////////////////////////////////////////////////////////////////

